export type SheetRow = {
  ประทับเวลา: string
  เพศ: string
  "ปัจจุบันท่านมีอายุ เท่าใด": number
  "วุฒิการศึกษาสูงสุดที่ท่านได้รับคือ": string
  "ปัจจุบันท่านดำรงตำแหน่งระดับใด": string

  "1. หน่วยงานท่านปฏิบัติงานมีบัญชีรายการยาที่ต้องเฝ้าระวังสูง ( High-Alert Medication: HAM)  ": number
  "2. หน่วยงานท่านปฏิบัติงานมีการแยกเก็บยา HAM ถูกเก็บในตู้/ลิ้นชักเฉพาะ มีป้ายเตือน “ยาที่ต้องเฝ้าระวังสูง” หรือป้ายสัญลักษณ์สี ชัดเจน": number
  "3.หน่วยงานท่านมีการจำกัดการเข้าถึง การเบิก/เปิดตู้ยา HAM จำกัดเฉพาะบุคลากรตามนโยบาย เช่น พยาบาลวิชาชีพ": number
  "4.การตรวจสต็อกประจำเวร (ตรวจชนิดยา ความแรง ปริมาณคงเหลือ และวันหมดอายุถูกต้อง ครบถ้วน)": number
  "5.ความครบถ้วน ถูกต้องของคำสั่งยา (คำสั่งยาทุกใบมีชื่อยา ความแรง ขนาดยา route ความถี่ อัตราหยด/เวลาให้ และไม่มีคำสั่งกำกวม เช่น “ตามเดิม”)": number
  "6.การใช้แบบฟอร์ม/แนวทางมาตรฐาน (การใช้ order set/protocol สำหรับยาเฉพาะ เช่น insulin infusion, heparin, opioids ทาง PCA ตามนโยบายโรงพยาบาล)": number
  "7.การเตรียมยา (การเตรียมยาเป็นไปตามมาตรฐาน ความเข้มข้นมาตรฐาน ตัวทำละลายที่กำหนด การติดฉลากชื่อผู้ป่วย/ยา/ความแรง/เวลาเตรียม)": number
  "8.การตรวจสอบซ้ำ\n   8.1รายการกลุ่มยา\n   8.2 มีลายมือชื่อผู้เตรียม/ให้ยา \n   8.3 มีลายมือชื่อผู้ตรวจสอบซ้ำ\n ": number
  "9.การประเมินก่อนให้ยา (มีการประเมิน vital signs สภาพทั่วไป และข้อบ่งชี้/ข้อห้ามของยาอย่างเหมาะสม)": number
  "10.การติดตามหลังให้ยา ( มีการติดตาม vital signs, ระดับความรู้สึกตัว, pain score และ/หรือผลตรวจทางห้องปฏิบัติการที่จำเป็น (เช่น INR, aPTT, glucose, K+, LFT, Renal function)": number
  "11.หากหน่วยงานท่านเกิด เหตุการณ์ไม่พึงประสงค์/ เกือบพลาด มีการบันทึก ตามแบบฟอร์มและรายงาน ความสู่ระบบอย่างถูกต้อง และครบถ้วน": number
  "12.หัวหน้าเวรมีการกำกับติดตามในการบริหารการตรวจสอบการบันทึกการจัดการยาที่ต้องเฝ้าระวังสูง ": number
  "13.หัวหน้าเวรให้ feedback/คำแนะนำเพิ่มเติมแก่บุคลากรเมื่อพบข้อบกพร่องในการให้ยา HAD": number
  "14. การประสานงาน (ประสานกับแพทย์/เภสัชกร/หน่วยงานอื่นเกี่ยวกับปัญหา HAM ในเวรนี้)": number

  "กลุ่มยาที่ต้องเฝ้าระวังสูง": string
  "ระดับความคลาดเคลื่อน": string
  "การปฏิบัติตามแนวทางตรวจสอบบันทึกการจัดการยาที่ต้องเฝ้าระวังสูง": string
  "สาเหตุการปฏิบัติไม่ครบหรือไม่ปฏิบัติตามแนวทางการตรวจสอบบันทึกการจัดการยาที่ต้องเฝ้าระวังสูง": string
  "การบริหารจัดการต่อเนื่อง": string
  "พบความคลาดเคลื่อน": string
  "ความผิดพลาดในการจัดการยาที่พบ": string
}